In [6]:
import sqlite3 as sqlite
conn = sqlite.connect('sample2.db')

In [7]:
print(conn)

<sqlite3.Connection object at 0x0000014332105D40>

In [3]:
cursor = conn.cursor()
print(cursor)

<sqlite3.Cursor object at 0x00000143322791C0>

In [ ]:
cursor.execute('CREATE TABLE users(name varchar(100), id int)')

In [ ]:
# INSERT ONE ROw
cursor.execute('INSERT into users VALUES(?,?)',['shanover',1])

In [ ]:
# INSERT Multiple Rows
data = [('Ujjawal',2),('Sunil',3),('Bigyan',4)]
cursor.executemany('insert into users values(?,?)',data)

In [4]:
def showAll(cursor,table):
    cursor.execute('SELECT * FROM '+table)

    rows = cursor.fetchall()

    print('There are :', len(rows),' rows')
    for row in rows:
        print(row)

In [ ]:
# UPDATE Query
idUp = 1
newName = 'Shan'

cursor.execute('update users set name=? WHERE id = ?',(newName,idUp))

In [5]:
# Create employee table

sql = '''CREATE TABLE employee(
            id int not null primary key,
            first_name varchar(30) not null,
            last_name varchar(30),
            age int not null,
            sex char(1),
            income float
            )'''

cursor.execute(sql)
conn.commit()

OperationalError: table employee already exists

In [8]:
showAll(cursor,'employee')

There are : 0  rows

In [ ]:
def describe(table_name):
    cursor.execute(f"PRAGMA table_info({table_name})")

    # Fetch all the rows returned by the query
    rows = cursor.fetchall()

    # Process the fetched rows
    for row in rows:
        column_name = row[1]
        column_type = row[2]
        is_nullable = row[3]
        pk = row[5]

        print(f"Column Name: {column_name}, Column Type: {column_type}, Nullable: {is_nullable}, PK: {pk}")

In [ ]:
describe('employee')

In [26]:
# Insert

data = [
#     (11, 'Samista','Sharma',26,'F',1000),
#     (21, 'Nikhil','Sharma',26,'M',1000),
#     (32, 'Ujjawal','Sharma',26,'M',899000),
#     (42, 'Sunil','Sharma',26,'M',10000000),
    (54, 'Ronaldo','Cris',26,'M',99999999)
]


cursor.executemany('insert into shanover values(?,?,?,?,?,?)', data)
print(cursor.rowcount)

1

In [12]:
showAll(cursor,'employee')

There are : 0  rows

In [ ]:
# fetch one

cursor.execute('SELECT * from employee')
result = cursor.fetchone()
print(result)

In [ ]:
# fetch many

cursor.execute('SELECT * from employee')
result = cursor.fetchmany(2)
print(result)

In [ ]:
# fetch many

cursor.execute('SELECT * from employee')
result = cursor.fetchall()
print(result)

In [ ]:
# fetch many

cursor.execute('SELECT * from employee WHERE sex=?','M')
result = cursor.fetchall()
print(result)

In [ ]:
# Alter column name

cursor.execute(f"ALTER TABLE {'employee'} RENAME COLUMN {'age'} TO {'age_of_employee'}")

In [ ]:
import pandas as pd

df = pd.read_sql(f"SELECT * from employee",conn)
df.head()

In [21]:
# Delete operation

cursor.execute('''DELETE from shanover where sex="M"''')

In [13]:
# Remame table name

cursor.execute('''alter table employee rename to shanover''')

In [31]:
showAll(cursor,'shanover')

OperationalError: no such table: shanover

In [28]:
# Remvoe rows with first name

cursor.execute('''delete from shanover where first_name like "r%" ''')

In [30]:
cursor.execute('''drop table shanover''')